# Taps
tap 'caskroom/cask'
tap 'caskroom/fonts'
tap 'caskroom/versions'
tap 'homebrew/bundle'
tap 'homebrew/dupes'
tap 'homebrew/php'

# Install ZSH
brew 'zsh'
brew 'zsh-completions'

# Install GNU core utilities (those that come with macOS are outdated)
brew 'coreutils'

# Install GNU `find`, `locate`, `updatedb`, and `xargs`, g-prefixed
brew 'findutils'

# Install Bash 4
brew 'bash'

# Install more recent versions of some macOS tools
brew 'homebrew/dupes/grep'

# Install Binaries
brew 'awscli'
brew 'git'
brew 'hub'
brew 'tree'
brew 'mackup'
brew 'mas'
brew 'node'
brew 'trash'
brew 'tldr'
brew 'wget'
brew 'htop'
brew 'watch'

# Web server
brew "nginx"
brew "mysql"

# Development
brew 'php71', args: ['with-debug']
brew 'mariadb'
brew "ruby"
brew "python3"
brew "go"

# Apps
cask "1password"
cask 'alfred'
cask 'caffeine'
cask 'dropbox'
cask 'firefox'
cask "cleanmymac"
cask "goofy"
cask "screenflick"
cask 'google-chrome'
cask 'google-drive'
cask "harvest"
cask "flux"
cask 'iterm2'
cask 'mysqlworkbench'
cask 'phpstorm'
cask 'sequel-pro'
cask 'slack'
cask 'sublime-text'
cask 'sourcetree'
cask 'transmit'
cask 'vagrant'
cask 'virtualbox'
cask 'virtualbox-extension-pack'
cask 'vlc'
cask "steam"
cask "whatsapp"
cask "spotify"

# Quicklook
cask 'qlcolorcode'
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'quicklook-csv'
cask 'qlstephen'
cask "betterzipql"
cask "qlimagesize"
cask "qlprettypatch"
cask "qlstephen"

# Fonts
cask 'font-sauce-code-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'
cask "font-fira-code"

# Install Mac App Store apps
mas 'Giphy Capture', id: 668208984
mas 'Paw', id: 584653203
mas 'Tweetbot', id: 557168941
